<template>
  <section>
    <h3>分层</h3>
    <br>
    <ul>
      <li>页面展示层</li>
      <li>业务胶合层</li>
      <li>业务组件层</li>
      <li>通用组件层</li>
    </ul>
    <br>
    <p>从下到上稳定性依次递减，依赖关系由上到下，每一层都向更稳定的方向依赖</p>

    <br>
    <h3>通用组件层</h3>
    <p>通用组件层必须是最稳定的</p>
    <p>由于任何修改都会影响所有依赖，因此需要考虑向后兼容</p>
    <p>通用组件层中的组件并不是完全独立的，因为即便是通用组件，仍然会存在公用的样式或方法，也就是说通用组件尽管依赖最小，仍然可以抽象出一个基础样式库 base.css 和基础方法库 util.js</p>
    <p>通用组件、基础样式、基础方法共同构成了通用组件层</p>

    <br>
    <br>
    <h3>通用组件与业务组件的关系与异同</h3>
    <br>
    <p>1. 通用组件可以进一步封装为业务组件，业务组件中可以抽象出通用组件</p>
    <p>2. 通用组件更接近于纯函数，可以单独测试、单独导出、四处移植；业务组件与业务逻辑耦合，不具备通用性</p>
    <p>3. 通用组件仅包含最稳定的逻辑，不稳定的部分需要通过参数配置、定制 slot 或外部进一步封装实现；业务组件更接近最终可用状态</p>
    <p>4. 通用组件的关注点是分离变化与不变的部分，业务组件关注业务实现</p>
  </section>
</template>