<template>
	<section>
		<h3>方法论</h3>
		<br>
		<h3>什么是组件化开发</h3>
		<br>
		<p>组件化开发基于这样一种理念：界面就是数据结构的可视化表达</p>
		<p>UI = f(data)</p>
		<p>而界面就是组件的组合</p>
		<p>UI = f1(data) + f2(data) + f3(data) + ...</p>
		<p>jQuery 时代的组件，准确的说只能叫插件（plugin）</p>
		<p>现代的组件（component）对应的是一套开发理念和方法论</p>

		<br>
		<br>
		<h3>为什么需要组件化开发</h3>
		<br>
		<p>1. 组件化是一种管理复杂度的手段</p>
		<p>2. 组件化可以通过复用提高效率</p>

		<br>
		<br>
		<h3>组件的结构</h3>
		<br>
		<p>组件的三个基本元素</p>
		<p>1. HTML</p>
		<p>2. CSS</p>
		<p>3. JS</p>
		<p>组件包含三部分内容</p>
		<p>1. 样式</p>
		<p>2. 数据</p>
		<p>3. 逻辑</p>
		
		<br>
		<br>
		<h3>组件的特征</h3>
		<br>
		<p>独立性。独立意味着可以单独引用、单独测试。最好的组件类似于纯函数，无副作用，意味着组件之间是正交的，可以任意替换而不影响其它功能</p>
		<p>数据驱动。而不是事件驱动。重心在于数据结构，而不是指令式的操作具体的 DOM</p>
		<p>DHTML。后端模板返回的仅仅是字符串，而组件是经过封装的 HTML，自动将数据映射为视图，不需要操作 DOM</p>

		<br>
		<br>
		<h3>组件的不可能三角</h3>
		<p>复用 | 灵活 | 体积</p>
		<p>以上三个目标几乎不可能同时达到，通常只能实现两个，妥协一个</p>
		<p>要追求复用与灵活，意味着一个组件要匹配各种场景，代码量势必膨胀。通常面向公众的开源 UI 库的情况就是如此</p>
		<p>要追求复用与精简，意味着一个组件只能匹配相对单一的场景。通常特定项目的业务组件就是如此</p>
		<p>要追求灵活与精简，意味着需要额外的代码去补足功能，这就牺牲了复用性</p>


		<br>
		<br>
		<h3>组件化开发涉及的问题</h3>
		<br>
		<p>组件该如何封装？</p>
		<p>组件该如何组织？</p>
		<p>组件该如何加载？</p>
		<p>组件之间如何通信？</p>
		<p>组件如何满足定制化需求？</p>

		<br>
		<br>
		<h3>其它</h3>
		<p><a href="https://zhuanlan.zhihu.com/p/31117272">可用性</a></p>
	</section>
</template>