<template>
  <section>
    <h3>组件设计原则</h3>
    <p>参考豆瓣张克军组件设计14条原则</p>

    <br>
    <h3>单一职责</h3>
    <p>一个组件只做一件事，控制粒度和边界，追求精简，避免太多参数</p>

    <br>
    <h3>开放封闭、SPOT 原则、DRY 原则</h3>
    <p>只要存在重复，就应该考虑抽象出重复的公共部分，单独封装。引用而非拷贝。</p>

    <br>
    <h3>追求纯组件</h3>
    <p>无副作用、引用透明</p>

    <br>
    <h3>减少依赖、向稳定方向依赖</h3>
    <p>依赖会破坏独立性。如果不得不依赖，则向底层稳定方向依赖</p>

    <br>
    <h3>充分隔离变化的部分</h3>
    <p>封装稳定不变的部分，变化的部分由外部配置、封装、传参实现</p>

    <br>
    <h3>适用好莱坞法则</h3>
    <p>子组件在父组件中组装，由父组件负责组织和控制</p>
  </section>
</template>